# -*- mode: org -*-
#+SETUPFILE: ~/.vault/cfgs/org-central/org-setupfile
#+TITLE: notes on GeMa // Vagrant

* synopsis
* advisement
* chapters
** Introduction to Vagrant
:PROPERTIES:
:ID: 1D071C98-AF1C-41D3-8995-E2983DBCF23D
:END:
:LOGBOOK:
:END:

 - context ::
   - [0/0] overview
   - info/notes
     - srcs
       #+NAME: 1D071C98-AF1C-41D3-8995-E2983DBCF23D-srcs
       #+CAPTION: reference list
       | ! | title | url                                                  | desc        | rowid   |
       |   | title | url                                                  | desc        | rowid   |
       |---+-------+------------------------------------------------------+-------------+---------|
       | / |       |                                                      |             | <7>     |
       | # |       | https://github.com/mitchellh/vagrant/pull/6473/files | partial fix | <<42D488C7-B7B9-4959-81DE-78FEA3029DA5>> |
       | # |       | https://github.com/mitchellh/vagrant/issues/5973     |             | <<D4A0B71F-3449-42F8-9EF2-762BD42C433F>> |
       | # |       |                                                      |             | <<549FD491-0546-4620-8B03-385542E261AF>> |
       #+TBLFM: $5='(if (and (string= @1$rowid "rowid") (string= $rowid "")) (concat "<<"(org-id-new) ">>") $rowid)
     - on Initial Understanding a/o Discovery
       - start vagrant vm's w/ =vagrant up --provision <vm_name>=
     - on Vagrant Provider Selection
       - =virtualbox= is used by default, but =vmware_fusion= can be selected by setting an environment variable
         #+BEGIN_EXAMPLE
           >$  vagrant status
           Current machine states:

           salt-test-d1              not created (virtualbox)
           salt-test-d2              not created (virtualbox)
           salt-test-d3              not created (virtualbox)
           salt-master-d1            not created (virtualbox)

           This environment represents multiple VMs. The VMs are all listed
           above with their current state. For more information about a specific
           VM, run `vagrant status NAME`.

           >$ env VAGRANT_DEFAULT_PROVIDER='vmware_fusion' vagrant status
           Current machine states:

           salt-test-d1              not created (vmware_fusion)
           salt-test-d2              not created (vmware_fusion)
           salt-test-d3              not created (vmware_fusion)
           salt-master-d1            not created (vmware_fusion)

           This environment represents multiple VMs. The VMs are all listed
           above with their current state. For more information about a specific
           VM, run `vagrant status NAME`.
         #+END_EXAMPLE
     - on Commonly Useful Vagrant Manager commands
       |   |   |   |
       |---+---+---|
       |   |   |   |
   - Questions
   - log
     - [2016-03-02 Wed]
       - [2016-03-02 Wed 00:35]
         #+BEGIN_SRC bash
           brew uninstall --force brew-cask; brew untap phinze/cask; brew update; brew cleanup; brew cask cleanup
           brew cask install vagrant
         #+END_SRC
       - [2016-03-02 Wed 14:19]
         #+BEGIN_SRC bash :results drawer :wrap EXAMPLE
         echo landrush vagrant-vmware-fusion | xargs -n1 vagrant plugin install
         vagrant plugin license vagrant-vmware-fusion ~/.vault/cfgs/vagrant-central/vagrant-plugin-vmware-fusion-license
         #+END_SRC

         #+RESULTS:
         #+BEGIN_EXAMPLE
         Installing the 'landrush' plugin. This can take a few minutes...
         Installed the plugin 'landrush (1.2.0)'!
         Installing the 'vagrant-vmware-fusion' plugin. This can take a few minutes...
         Installed the plugin 'vagrant-vmware-fusion (4.0.22)'!
         Installing license for 'vagrant-vmware-fusion'...
         The license for 'vagrant-vmware-fusion' was successfully installed!
         #+END_EXAMPLE

       - [2016-03-02 Wed 15:31] see https://github.com/vagrant-landrush/landrush/issues/165
       - [2016-03-02 Wed 16:16] NGa muses that this may not be a plugin problem, but may be a vagrant box build problem b/c CentOSv6 works fully and CentOSv7 works except for HGFS. It's only CentOSv5 that triggers this problem.
     - [2017-07-17 Mon]
       - [2017-07-17 Mon 17:46] EM required complete uninstall and reinstall
         #+BEGIN_EXAMPLE
           Vagrant failed to initialize at a very early stage:

           The plugins failed to initialize correctly. This may be due to manual
           modifications made within the Vagrant home directory. Vagrant can
           attempt to automatically correct this issue by running:

             vagrant plugin repair

           If Vagrant was recently updated, this error may be due to incompatible
           versions of dependencies. To fix this problem please remove and re-install
           all plugins. Vagrant can attempt to do this automatically by running:

             vagrant plugin expunge --reinstall

           Error message given during initialization: Unable to resolve dependency: user requested 'landrush (> 0)'

         #+END_EXAMPLE

 - procedure :: common operations
   - vagrant test ping
     #+BEGIN_SRC bash :dir ~/.extrefs/gema-ctl :results drawer
     vagrant ssh SV-SALTMASTER-T1 -c 'sudo salt-call --local test.ping'                                                                                  
     #+END_SRC
   - vagrant call master install state
     #+BEGIN_SRC bash :dir ~/.extrefs/gema-ctl :results drawer
     vagrant ssh SV-SALTMASTER-T1 -c 'sudo salt-call --local --file-root=/vagrant/srv/roots/base state.sls config.apps.salt.master.install test=True'
     #+END_SRC
   - add personal pubkey to vagrant boxes after start up
     #+BEGIN_SRC bash
     cat ~/.ssh/id_rsa.pub | vagrant ssh salt-master-d1 -c 'cat >> ~/.ssh/authorized_keys'
     #+END_SRC

 - procedure :: setup vagrant
   - install brew
   - install vagrant and vagrant-manager
   - install vagrant plugins: landrush (hostname/DNS), vagrant-triggers (command injection)
     #+BEGIN_SRC bash :results drawer :wrap EXAMPLE
       echo landrush vagrant-triggers vagrant-vmware-fusion | xargs -n1 vagrant plugin install
       vagrant plugin license vagrant-vmware-fusion ~/.vault/cfgs/vagrant-central/vagrant-plugin-vmware-fusion-license
       #vagrant plugin install vagrant-vlan # for VLAN handling
       #vagrant plugin install vagrant-vbguest #
     #+END_SRC

     #+RESULTS:
     #+BEGIN_EXAMPLE
     Installing the 'landrush' plugin. This can take a few minutes...
     Installed the plugin 'landrush (1.2.0)'!
     Installing the 'vagrant-triggers' plugin. This can take a few minutes...
     Installed the plugin 'vagrant-triggers (0.5.3)'!
     #+END_EXAMPLE

 - procedure :: (wip) howto, whitelist the landrush process w/ the MacOSX application firewall
   - nb
     - by whitelisting the landrush executable this will prevent the firewall prompts while allowing for normal operation
     - landrush is a pure ruby daemon so we'll need to add the ruby binary to the whitelist
     - landrush uses the embedded ruby binary that ships w/ Vagrant, not the system ruby.
   - add the landrush ruby binary path to the MacOSX firewall, =/opt/vagrant/embedded/bin/ruby=

** howto, fix problems in Vagrant
:PROPERTIES:
:ID: 62205C54-AA98-4162-9D7E-F97634EB0508
:END:
:LOGBOOK:
:END:
[2017-06-24 Sat 12:01]
[[git:~/.vault/uris/gema-ctl/usr/doc/ref-Vagrant.org::next@{2017-06-24}::112][git:~/.vault/uris/gema-ctl/usr/doc/ref-Vagrant.org::next@{2017-06-24}::112]]
 - context :
   - [0/0] overview
   - info/notes
     - srcs
       #+NAME: 62205C54-AA98-4162-9D7E-F97634EB0508-srcs
       #+CAPTION: reference list
       |!|title|url|desc|rowid|
       | |title|url|desc|rowid|
       |-|-----|---|----|-----|
       |/|     |   |    | <7> |
       |#|     |   |    |     |
       #+TBLFM: $5='(if (and (string= @1$rowid "rowid") (string= $rowid "")) (concat "<<"(org-id-new) ">>") $rowid)
   - Questions
   - log
     - [2018-10-08 Mon]
       - an aux utility for vmware, available here: https://www.vagrantup.com/docs/vmware/vagrant-vmware-utility.html not sure when this became important/required

 - procedure :: fix, specious forwarded port warning, EM:"... the defined forwarded ports would collide ..."
   - nb
     - https://github.com/mitchellh/vagrant/issues/7948
     - [2017-06-24 Sat 12:02] Error Message
       #+BEGIN_EXAMPLE
         ==> salt-master-d1: Preparing network adapters...
         Some of the defined forwarded ports would collide with existing
         forwarded ports on VMware network devices. This can be due to
         existing Vagrant-managed VMware machines, or due to manually
         configured port forwarding with VMware. Please fix the following
         port collisions and try again:

         2222
         make: *** [vagrant-prep-salt-master-d1] Error 1
         bash-4.4$ 
       #+END_EXAMPLE
   - (alt.) on MacOSX
     - clear specious port mapping entries from '[incomingtcp]' section of the [[/sudo:localhost:/Library/Preferences/VMware Fusion/vmnet8/nat.conf][/Library/Preferences/VMware Fusion/vmnet8/nat.conf]]
     - (wip) somehow related: [[/Library/Preferences/VMware fusion/networking]]
** info, Vagrant Manager
:PROPERTIES:
:ID: 356594C4-EDC9-453A-83EE-9C41E65D80CE
:END:
[2017-10-22 Sun 11:02]
[[git:~/.vault/uris/gema-ctl/usr/doc/ref-Vagrant.org::next@{2017-10-22}::190][git:~/.vault/uris/gema-ctl/usr/doc/ref-Vagrant.org::next@{2017-10-22}::190]]
 - context ::
   - [/] overview
   - info/notes
     - srcs
       #+NAME: 356594C4-EDC9-453A-83EE-9C41E65D80CE-srcs
       #+CAPTION: reference list
       |!|title|url|desc|rowid|
       | |title|url|desc|rowid|
       |-|-----|---|----|-----|
       |/|     |   |    | <7> |
       |#|     |   |    |     |
       #+TBLFM: $5='(if (and (string= @1$rowid "rowid") (string= $rowid "")) (concat "<<"(org-id-new) ">>") $rowid)
     - on Custom Commands
       | idx | name                    | command                               | run_in_terminal | desc |
       |     | journal                 | sudo journalctl -f                    |                 |      |
       |     | salt-master:accept-keys | sudo salt-key -Ay                     |                 |      |
       |     | salt:logs               | sudo tail -f /var/log/salt/*          |                 |      |
       |     | salt-minion:highstate   | sudo salt-call state.apply            |                 |      |
       |     | salt-master:messagebus  | sudo salt-run state.event pretty=True |                 |      |
   - Questions
   - log
